In [1]:
#1번

a=1
b=2
print(a+b)

3

In [2]:
#2번

rnn=(input("주민등록번호를 입력하시오 "))
print(rnn[:6])

주민등록번호를 입력하시오 951107
951107

In [3]:
#3번

a="20010331Rainy"

date=a[:8]
weather=a[8:]

print("날짜 : ", date)
print("날씨 : ", weather)

날짜 :  20010331
날씨 :  Rainy

In [4]:
#4번

a="Pithon"

aa=a[:1]+'y'+a[2:]

print(aa)

Python

In [5]:
#5번

a=[1,2,['a','b',['Life','is']]]

print(a[2][2][0])

Life

In [12]:
#6번

k=80
e=75
m=55

print((k+e+m)/3)

70.0

In [22]:
#7번

l=[1,4,7,132]

for i in l:
    if i%2==0:
        print("i = {} 짝수". format(i))
    else:
        print("i = {} 홀수". format(i))

i = 1 홀수
i = 4 짝수
i = 7 홀수
i = 132 짝수

In [23]:
#인자, 반환값 없는 def 함수

def my_fun():
    print("My first funtion")
    print("My first funtion")

In [24]:
my_fun()

My first funtion
My first funtion

In [25]:
#인자는 있으나 반환값이 없는 함수

def my_friend(name):
    print("{}는 나의 친구".format(name))

In [27]:
my_friend("홍길동")

홍길동는 나의 친구

In [30]:
def my_info(name, id, number):
    print("name = ", name)
    print("id = ", id)
    print("number = ", number)
    
my_info("승", 95, "010-2966")

name =  승
id =  95
number =  010-2966

In [31]:
#인자도 있고 반환값도 있는 함수

def my_calc(x,y):
    z=x*y
    return z

my_calc(3,5)

15

In [32]:
ex=my_calc(4,4)
print(ex)

16

In [35]:
#갯수를 알수 없을경우 변수앞에 *를 붙이면 입력값을 모아 튜플로 만들어줌

def sum_many(*args):
    sum=0
    for i in args:
        sum=sum+i
    return sum

sum_many(1,2,3,4,5)

15

In [37]:
class Calculator:
    txt="문자"
    def sum(self, a, b):
        return a+b
    
x=Calculator()
x.sum(3,4)

7

In [3]:
#import로 Pandas 불러오기
from pandas import Series, DataFrame

#import pandas as pd 이렇게 Pandas를 불러올 시,
#...=pd.Series 로 작성해야함

#Pandas Series 만들기
fruit= Series(data=[2500,3800,1200,6000], index = ['apple','banana','peer','cherry'])
print(fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [4]:
#value의 index

print(fruit.values)
print(fruit.index)

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [9]:
#딕셔너리를 Series로 변환하기

fruitData={'apple':2500, 'banana':3800, 'peer':1200, 'cherry':6000}
fruit=Series(fruitData)
print(type(fruitData))
print(type(fruit))
print(fruitData, fruit)

<class 'dict'>
<class 'pandas.core.series.Series'>
{'apple': 2500, 'banana': 3800, 'peer': 1200, 'cherry': 6000} apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [10]:
#Series Name, Index Name 만들기

fruit.name='fruitPrice'
fruit.index.name='fruiName'
print(fruit)

fruiName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [12]:
#Dataframe 만들기

fruitData={'fruitName':['apple','banana','cherry','peer'],
          'fruitPrice':[2500,3800,6000,1200],
          'num':[10,5,3,8]}

fruitFrame=DataFrame(fruitData)
print(fruitFrame)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [16]:
#DataFrame column 순서 바꾸기

fruitFrame=DataFrame(fruitData, columns=['fruitPrice','num','fruitName'])
print(fruitFrame)

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      peer

In [17]:
#DataFrame 특정 항목 추출하기

fruitFrame['fruitName']

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [20]:
#DataFrame 특정 항목 추출하기2

fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [21]:
#DataFrame Column 같은 값 추가하기

fruitFrame['year']=2016
print(fruitFrame)

   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      peer  2016

In [22]:
#DataFrame Column 다른 값 추가하기

variable=Series(data=[4,2,1], index=[0,2,3])
fruitFrame['stock']=variable

print(fruitFrame)

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0

In [24]:
#Series 데이터 row 삭제하기 .dorp()

fruit= Series(
    data=[2500,3800,1200,6000],
    index = ['apple','banana','peer','cherry'])
new_fruit=fruit.drop('banana')

print(fruit)
print('*'*30)
print(new_fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
******************************
apple     2500
peer      1200
cherry    6000
dtype: int64

In [29]:
#DataFrame 데이터 row 삭제하기 .drop()

fruitData={'fruitName':['apple','banana','cherry','peer'],
          'fruitPrice':[2500,3800,6000,1200],
          'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(data=fruitData, index=fruitName, columns=['fruitPrice','num'])
fruitFrame2=fruitFrame.drop(['apple','cherry'])

print(fruitFrame)
print('*'*30)
print(fruitFrame2)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
******************************
        fruitPrice  num
banana        3800    5
peer          1200    8

In [28]:
#DataFrame 데이터 array/column 삭제하기 .drop()

fruitFrame3=fruitFrame.drop('num',axis=1)  
#axis=1 을 주는 이유는 열을 삭제하기 위해서 제시, 기본값 0일때 행을 삭제

print(fruitFrame)
print('-'*30)
print(fruitFrame3)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
------------------------------
        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [30]:
#Series의 slice

fruit['apple':'peer']

apple     2500
banana    3800
peer      1200
dtype: int64

In [35]:
#DataFrame의 slice

print(fruitFrame)
print('-'*30)
print(fruitFrame['fruitPrice'])
print('-'*30)
print(fruitFrame['apple':'banana'])

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
------------------------------
apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64
------------------------------
        fruitPrice  num
apple         2500   10
banana        3800    5

In [56]:
a={'Nation':['KOR','USA','RUS'],
  'CountryCode':[82,1,7],
  'Language':['Korean','English','Russian']}
aindex=a['Nation']
adf=DataFrame(data=a, index=aindex, columns=['CountryCode','Language'])

p=Series(data=['5M','300M','150M'], index=['KOR','USA','RUS'])
adf['Population']=p

adf

     CountryCode Language Population
KOR           82   Korean         5M
USA            1  English       300M
RUS            7  Russian       150M

In [41]:
#Series 연산

fruit1 = Series(data=[5,9,10,3], index=['apple','banana','cherry','peer'])
fruit2 = Series(data=[3,2,9,5,10], index=['apple','orange','banana','cherry','mango'])

print(fruit1)
print('-'*40)
print(fruit2)
print('-'*40)
fruit1+fruit2

apple      5
banana     9
cherry    10
peer       3
dtype: int64
----------------------------------------
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64
----------------------------------------

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [45]:
#Dataframe의연산

fruitData1 = {'Ohio':[4,8,3,5],'Texas':[0,1,2,3]}
fruitFrame1 = DataFrame(data=fruitData1, columns=['Ohio','Texas'], index=['apple','banana','cherry','peer'])

fruitData2 = {'Ohio':[3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(data=fruitData2, columns=['Ohio','Colorado'], index=['apple','orange','banana','cherry','mango'])

print(fruitFrame1)
print('-'*40)
print(fruitFrame2)
print('-'*40)
fruitFrame1+fruitFrame2

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3
----------------------------------------
        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0
----------------------------------------

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [48]:
#Series 정렬

fruit= Series(data=[2500,3800,1200,6000], index = ['apple','banana','peer','cherry'])
fruit.sort_values(ascending=False) 
#ascending=False 내림차순
#ascending=True 오름차순

cherry    6000
banana    3800
apple     2500
peer      1200
dtype: int64

In [59]:
#DataFrame 정렬
#index 오름차순으로 정렬은 (df.sort_index())
#columns 오름차순으로 정렬은 (df.sort_index(axis=1))

fruitData={'fruitName':['peer','banana','apple','cherry'],
          'fruitPrice':[2500,3800,6000,1200],
          'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(data=fruitData, index=fruitName, columns=['num','fruitPrice'])

print(fruitFrame)
print('-'*40)

fruitFrame.sort_index(axis=1)
#fruitFrame.sort_index()

        num  fruitPrice
peer     10        2500
banana    5        3800
apple     3        6000
cherry    8        1200
----------------------------------------

        fruitPrice  num
peer          2500   10
banana        3800    5
apple         6000    3
cherry        1200    8

In [60]:
#DataFrame 값에 따른 정렬

print(fruitFrame.sort_values(by=['num'],ascending=False))
fruitFrame.sort_values(by=['fruitPrice'])

        num  fruitPrice
peer     10        2500
cherry    8        1200
banana    5        3800
apple     3        6000

        num  fruitPrice
cherry    8        1200
peer     10        2500
banana    5        3800
apple     3        6000

In [68]:
#Pandas를 이용해 외부 데이터 불러오기

import pandas as pd

german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv")
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [74]:
#앞 5가지 index만 확인하는 head 함수
german.head(-3)
#german.tail() 끝에서부터 확인

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
992,0,1,18,2,1,7511,5,5,1,3,...,4,2,51,3,3,1,3,2,2,1
993,0,1,18,4,0,3966,1,5,1,2,...,4,1,33,1,1,3,3,1,2,1
994,0,1,12,0,3,6199,1,3,4,3,...,2,2,28,3,1,2,3,1,2,1
995,0,1,24,2,3,1987,1,3,2,3,...,4,1,21,3,1,1,2,2,1,1
996,0,1,24,2,0,2303,1,5,4,3,...,1,1,45,3,2,1,3,1,1,1

In [70]:
#데이터 규모를 알아보는 shape함수

german.shape

(1000, 21)

In [72]:
#데이터에대한 기본 정보 확인하는 info함수
german.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Creditability                      1000 non-null   int64
 1   Account Balance                    1000 non-null   int64
 2   Duration of Credit (month)         1000 non-null   int64
 3   Payment Status of Previous Credit  1000 non-null   int64
 4   Purpose                            1000 non-null   int64
 5   Credit Amount                      1000 non-null   int64
 6   Value Savings/Stocks               1000 non-null   int64
 7   Length of current employment       1000 non-null   int64
 8   Instalment per cent                1000 non-null   int64
 9   Sex & Marital Status               1000 non-null   int64
 10  Guarantors                         1000 non-null   int64
 11  Duration in Current address        1000 non-null   int64
 12  Most valuable available asset      1000 non-null   int64
 13  Age (years)                        1000 non-null   int64
 14  Concurrent Credits                 1000 non-null   int64
 15  Type of apartment                  1000 non-null   int64
 16  No of Credits at this Bank         1000 non-null   int64
 17  Occupation                         1000 non-null   int64
 18  No of dependents                   1000 non-null   int64
 19  Telephone                          1000 non-null   int64
 20  Foreign Worker                     1000 non-null   int64
dtypes: int64(21)
memory usage: 164.2 KB

In [82]:
#데이터 Sample 만들기
#원하는 column을 불러올때는 대괄호 [[]] 두번 사용하기!

german_sample=german[['Creditability','Duration of Credit (month)','Purpose','Credit Amount']]
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [78]:
#Sample 중 최소값 min값 찾기

german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [79]:
#Sample 중 최대값 max값 찾기

german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [80]:
#Sample 중 평균값 mean값 찾기

german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [81]:
#Sample 데이터 요약통계량 확인하기

german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

In [83]:
#공분산을 통한 상관관계 알아보기
german_sample1=german[['Duration of Credit (month)','Credit Amount','Age (years)']]
german_sample1.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [84]:
#공분산을 통한 상관관계 알아보기
german_sample1.cov()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119

In [86]:
#Group by를 통한 요약통계 (Type of apartment 별 Credit Amount의 평균)
german_sample3=german[['Credit Amount','Purpose','Type of apartment']]
german_grouped=german_sample3['Credit Amount'].groupby(german_sample3['Type of apartment'])
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [89]:
#두 개 Group의 Group by를 이용한 요약통계 
#1번 순위 Purpose, 2번 순위 Type of apartment 별 Credit Amount의 평균

german_grouped2=german_sample3['Credit Amount'].groupby([german_sample3['Purpose'],german_sample3['Type of apartment']])
german_grouped2.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

In [107]:
#for 반복문을이용한 group으로 묶인 데이터 보기

german_sample4=german[['Type of apartment','Sex & Marital Status','Credit Amount']]
for t, g in german_sample4.groupby('Type of apartment'):
    print(t)
    print(g.head(n=3))
    print('-'*65)
print(g)

1
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
1                  1                     3           2799
2                  1                     2            841
-----------------------------------------------------------------
2
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
-----------------------------------------------------------------
3
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
-----------------------------------------------------------------
     Type of apartment  Sex & Marital Status  Credit Amount
29                   3                     3           4796
44                   3                     3           1239
69                   3                     3           2032
125                  3                     4           5103
146                  3                     3           2964
..                 ...                   ...            ...
971                  3                     2           8318
979                  3                     3           3386
991                  3                     2          12579
992                  3                     3           7511
997                  3                     3          12680

[107 rows x 3 columns]

In [125]:
#for 반복문을 이용한 2개 group으로 묶인 데이터 보기

for (t, s), g in german_sample4.groupby(['Type of apartment','Sex & Marital Status']):
    print((t,s))
    print(g.head(n=3))
    print('-'*65)

(1, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
369                  1                     1           3021
777                  1                     1           3384
797                  1                     1           2319
-----------------------------------------------------------------
(1, 2)
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
2                  1                     2            841
9                  1                     2           3758
-----------------------------------------------------------------
(1, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
1                  1                     3           2799
3                  1                     3           2122
5                  1                     3           2241
-----------------------------------------------------------------
(1, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
11                  1                     4           6187
14                  1                     4           1936
17                  1                     4           3213
-----------------------------------------------------------------
(2, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
50                   2                     1            640
97                   2                     1           4455
112                  2                     1           2366
-----------------------------------------------------------------
(2, 2)
    Type of apartment  Sex & Marital Status  Credit Amount
8                   2                     2           1098
12                  2                     2           1957
33                  2                     2           1376
-----------------------------------------------------------------
(2, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
-----------------------------------------------------------------
(2, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
48                  2                     4           1474
57                  2                     4           1053
78                  2                     4           1602
-----------------------------------------------------------------
(3, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
620                  3                     1           9277
749                  3                     1           2892
784                  3                     1           2149
-----------------------------------------------------------------
(3, 2)
     Type of apartment  Sex & Marital Status  Credit Amount
423                  3                     2           2133
453                  3                     2           5743
467                  3                     2           5324
-----------------------------------------------------------------
(3, 3)
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
-----------------------------------------------------------------
(3, 4)
     Type of apartment  Sex & Marital Status  Credit Amount
125                  3                     4           5103
-----------------------------------------------------------------

In [119]:
for (t, s), g in german_sample4.groupby(['Type of apartment','Sex & Marital Status']):
    print((t,s))
    print(g.head())
    print('-'*65)
    print(g.info())
    print('-'*65)
    print(g.shape)
    break

(1, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
369                  1                     1           3021
777                  1                     1           3384
797                  1                     1           2319
857                  1                     1           2302
932                  1                     1           1223
-----------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 369 to 956
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Type of apartment     6 non-null      int64
 1   Sex & Marital Status  6 non-null      int64
 2   Credit Amount         6 non-null      int64
dtypes: int64(3)
memory usage: 192.0 bytes
None
-----------------------------------------------------------------
(6, 3)

In [123]:
for (t, s) in german_sample4.groupby(['Type of apartment','Sex & Marital Status']):
    print((t,s))
    print('-'*65)
    print()

((1, 1),      Type of apartment  Sex & Marital Status  Credit Amount
369                  1                     1           3021
777                  1                     1           3384
797                  1                     1           2319
857                  1                     1           2302
932                  1                     1           1223
956                  1                     1           2767)
-----------------------------------------------------------------

((1, 2),      Type of apartment  Sex & Marital Status  Credit Amount
0                    1                     2           1049
2                    1                     2            841
9                    1                     2           3758
26                   1                     2            652
39                   1                     2           3868
..                 ...                   ...            ...
958                  1                     2           4280
963                  1                     2           3234
983                  1                     2           1882
989                  1                     2           2718
993                  1                     2           3966

[95 rows x 3 columns])
-----------------------------------------------------------------

((1, 3),      Type of apartment  Sex & Marital Status  Credit Amount
1                    1                     3           2799
3                    1                     3           2122
5                    1                     3           2241
10                   1                     3           3905
15                   1                     3           2647
20                   1                     3           3676
22                   1                     3           2384
115                  1                     3           6260
116                  1                     3           1919
119                  1                     3           3062
159                  1                     3           3617
174                  1                     3           1963
190                  1                     3           1901
201                  1                     3           7824
206                  1                     3           1107
237                  1                     3           2384
255                  1                     3           2687
270                  1                     3           1236
319                  1                     3           1204
320                  1                     3           1597
326                  1                     3           1418
343                  1                     3           3577
426                  1                     3          11760
434                  1                     3           1264
468                  1                     3           2323
483                  1                     3           5801
516                  1                     3           6967
538                  1                     3            730
550                  1                     3           2002
574                  1                     3           6948
577                  1                     3            684
580                  1                     3           1546
682                  1                     3           7057
694                  1                     3           1768
706                  1                     3           3617
714                  1                     3           3518
721                  1                     3           1905
732                  1                     3           3368
755                  1                     3            950
808                  1                     3           3345
811                  1                     3           7297
827                  1                     3           4843
832                  1                     3           7980
850                  1                     3           3031
889                  1                     3           9034
914                  1                     3           4110
926                  1                     3           3161
934                  1                     3           2625
946                  1                     3           2210
960                  1                     3           6761
962                  1                     3          15945
970                  1                     3           4844
973                  1                     3          11816
994                  1                     3           6199
995                  1                     3           1987)
-----------------------------------------------------------------

((1, 4),      Type of apartment  Sex & Marital Status  Credit Amount
11                   1                     4           6187
14                   1                     4           1936
17                   1                     4           3213
122                  1                     4           2063
172                  1                     4           1297
272                  1                     4            660
305                  1                     4           1469
383                  1                     4            276
398                  1                     4           1503
409                  1                     4           7166
443                  1                     4           1386
459                  1                     4           2445
496                  1                     4           2108
505                  1                     4           1740
662                  1                     4            585
725                  1                     4           2779
745                  1                     4           1766
862                  1                     4           1534
867                  1                     4           9398
883                  1                     4           1264
927                  1                     4            902
935                  1                     4           2235
959                  1                     4           3092)
-----------------------------------------------------------------

((2, 1),      Type of apartment  Sex & Marital Status  Credit Amount
50                   2                     1            640
97                   2                     1           4455
112                  2                     1           2366
135                  2                     1           1543
147                  2                     1           1262
154                  2                     1           1158
161                  2                     1           1275
175                  2                     1           3235
233                  2                     1           3857
279                  2                     1           1126
283                  2                     1           2353
293                  2                     1           1449
322                  2                     1           2142
352                  2                     1           7629
460                  2                     1           6468
486                  2                     1           3780
503                  2                     1           2058
512                  2                     1           3878
560                  2                     1           3485
581                  2                     1           2359
594                  2                     1           4583
605                  2                     1            975
611                  2                     1           2577
618                  2                     1           3108
641                  2                     1           6289
645                  2                     1          15857
675                  2                     1           1323
686                  2                     1           1521
735                  2                     1           1338
741                  2                     1           3059
759                  2                     1           2820
776                  2                     1           4297
792                  2                     1           6872
822                  2                     1           1938
837                  2                     1           4057
852                  2                     1           1935
860                  2                     1           3914
873                  2                     1           9572
933                  2                     1           1372
975                  2                     1          11998
986                  2                     1           8978)
-----------------------------------------------------------------

((2, 2),      Type of apartment  Sex & Marital Status  Credit Amount
8                    2                     2           1098
12                   2                     2           1957
33                   2                     2           1376
35                   2                     2            860
40                   2                     2            996
..                 ...                   ...            ...
976                  2                     2          18424
978                  2                     2           2762
982                  2                     2           5096
988                  2                     2            976
990                  2                     2            750

[196 rows x 3 columns])
-----------------------------------------------------------------

((2, 3),      Type of apartment  Sex & Marital Status  Credit Amount
4                    2                     3           2171
6                    2                     3           3398
7                    2                     3           1361
13                   2                     3           7582
16                   2                     3           3939
..                 ...                   ...            ...
977                  2                     3          14896
985                  2                     3           2292
996                  2                     3           2303
998                  2                     3           6468
999                  2                     3           6350

[409 rows x 3 columns])
-----------------------------------------------------------------

((2, 4),      Type of apartment  Sex & Marital Status  Credit Amount
48                   2                     4           1474
57                   2                     4           1053
78                   2                     4           1602
104                  2                     4           1851
107                  2                     4           1473
..                 ...                   ...            ...
967                  2                     4           1345
980                  2                     4           2039
981                  2                     4           2169
984                  2                     4           6999
987                  2                     4            674

[68 rows x 3 columns])
-----------------------------------------------------------------

((3, 1),      Type of apartment  Sex & Marital Status  Credit Amount
620                  3                     1           9277
749                  3                     1           2892
784                  3                     1           2149)
-----------------------------------------------------------------

((3, 2),      Type of apartment  Sex & Marital Status  Credit Amount
423                  3                     2           2133
453                  3                     2           5743
467                  3                     2           5324
478                  3                     2           2748
563                  3                     2           1377
629                  3                     2           2578
642                  3                     2           6419
643                  3                     2           6143
710                  3                     2           3757
809                  3                     2           1198
814                  3                     2           5129
816                  3                     2           1240
847                  3                     2          14782
848                  3                     2           2671
874                  3                     2           1837
895                  3                     2          12976
955                  3                     2           1190
971                  3                     2           8318
991                  3                     2          12579)
-----------------------------------------------------------------

((3, 3),      Type of apartment  Sex & Marital Status  Credit Amount
29                   3                     3           4796
44                   3                     3           1239
69                   3                     3           2032
146                  3                     3           2964
152                  3                     3           8858
..                 ...                   ...            ...
948                  3                     3           1442
968                  3                     3           1845
979                  3                     3           3386
992                  3                     3           7511
997                  3                     3          12680

[84 rows x 3 columns])
-----------------------------------------------------------------

((3, 4),      Type of apartment  Sex & Marital Status  Credit Amount
125                  3                     4           5103)
-----------------------------------------------------------------